<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"b9f162f87a7702e1a27a12145c8eaaae001b2af7b1689d13a9c12a3dfe240742","plan_job_ref":"Job Test actions using target and replace #448 at https://github.com/dflook/terraform-github-actions/actions/runs/12749584674","plan_out_hash":"26eec2bcd6702373da4dc777184596ce0fb28cce2e3dc90929a15ca261138179","plan_hash":"fd42638a3daa66b7cbdb5d21f3e44b629ab97e63293ec353d91b7cc400f412ea","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "fTHiQHPygG" -> (known after apply)
!~  foreach = "JRXvvwNcXE" -> (known after apply)
```
</details>

:memo: Plan generated in [Test actions using target and replace #448](https://github.com/dflook/terraform-github-actions/actions/runs/12749584674)